In [63]:
import pandas as pd

#series

data=pd.Series([10,20,30,40])

data=data.add(2)
data

0    12
1    22
2    32
3    42
dtype: int64

In [64]:
df = pd.DataFrame({
   "Name": ["Alice", "Bob", "Charlie"],
   "Age": [25, 32, 22]
})
print(df)

      Name  Age
0    Alice   25
1      Bob   32
2  Charlie   22

In [65]:
df=pd.DataFrame(
    {
        "Name": ["Alice", "Bob", "Charlie"],
        'english':[90,89,78],
        'math':[100,78,89],
        'science':[78,89,90]
    }
)

df

      Name  english  math  science
0    Alice       90   100       78
1      Bob       89    78       89
2  Charlie       78    89       90

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   english  3 non-null      int64
 2   math     3 non-null      int64
 3   science  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [67]:
df.describe()

         english   math    science
count   3.000000    3.0   3.000000
mean   85.666667   89.0  85.666667
std     6.658328   11.0   6.658328
min    78.000000   78.0  78.000000
25%    83.500000   83.5  83.500000
50%    89.000000   89.0  89.000000
75%    89.500000   94.5  89.500000
max    90.000000  100.0  90.000000

In [68]:
df.columns

Index(['Name', 'english', 'math', 'science'], dtype='object')

In [69]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [70]:
df['Name'].count()

3

In [71]:
df['science'].mean()

85.66666666666667

In [72]:
df=pd.DataFrame(
    {
        "Name": ["Alice", "Bob", "Charlie"],
        'english':[90,89,78],
        'math':[100,78,89],
        'science':[78,89,90]
    }
)
df

      Name  english  math  science
0    Alice       90   100       78
1      Bob       89    78       89
2  Charlie       78    89       90

In [73]:
# df=pd.DataFrame(
#     {
#         "Name": ["Alice", "Bob", "Charlie"],
#         'english':[90,89,78],
#         'math':[100,78,89],
#         'science':[78,89,90]
#     }, index=['x','y','z']
# )

# df

In [74]:
df.rename(columns={'Name':'Student Name','math': "Mathematics"},inplace=True)

df

  Student Name  english  Mathematics  science
0        Alice       90          100       78
1          Bob       89           78       89
2      Charlie       78           89       90

In [75]:
df.to_csv('student.csv',index=False)